Repository: bisslee/test-k2-employee-management
Catalog: back/Biss.EmployeeManagement/Biss.EmployeeManagement/src/Biss.EmployeeManagement.Domain/Resources/ResourceApp.*.resx
Languages: es_mx, pt_br

# EMPLOYEE_NOT_FOUND
source: Employee not found: {0}
es_mx: Empleado no encontrado: {0}
pt_br: Funcionário não encontrado: {0}

# EMPLOYEE_EMAIL_ALREADY_EXISTS
source: Employee with email '{0}' already exists.
es_mx: Empleado con email '{0}' ya existe.
pt_br: Funcionário com email '{0}' já existe.

# EMPLOYEE_EMAIL_ALREADY_EXISTS_WITH_ID
source: Employee with email '{0}' already exists (ID: {1}).
es_mx: Empleado con email '{0}' ya existe (ID: {1}).
pt_br: Funcionário com email '{0}' já existe (ID: {1}).

# EMPLOYEE_DOCUMENT_ALREADY_EXISTS
source: Employee with document number '{0}' already exists.
es_mx: Empleado con documento '{0}' ya existe.
pt_br: Funcionário com documento '{0}' já existe.

# EMPLOYEE_DOCUMENT_ALREADY_EXISTS_WITH_ID
source: Employee with document number '{0}' already exists (ID: {1}).
es_mx: Empleado con documento '{0}' ya existe (ID: {1}).
pt_br: Funcionário com documento '{0}' já existe (ID: {1}).

# GENERAL_ERROR
source: An error occurred
es_mx: Ocurrió un error
pt_br: Ocorreu um erro

source: Required Email
es_mx: Correo electrónico requerido
pt_br: E-mail é obrigatório

source: Invalid email
es_mx: Correo electrónico inválido
pt_br: E-mail inválido

# REQUIRED_PASSWORD
source: Password is required!
es_mx: ¡Contraseña requerida!
pt_br: Senha é obrigatória!

# MIN_LENGTH_PASSWORD
source: Password must be at least 8 characters long
es_mx: La contraseña debe tener al menos 8 caracteres
pt_br: Senha deve ter no mínimo 8 caracteres

# MAX_LENGTH_PASSWORD
source: Password must not exceed 255 characters
es_mx: La contraseña no debe exceder 255 caracteres
pt_br: Senha não deve exceder 255 caracteres

# REQUIRED_PHONE
source: Telephone is required!
es_mx: ¡Teléfono requerido!
pt_br: Telefone é obrigatório!

source: Invalid phone
es_mx: Teléfono inválido
pt_br: Telefone inválido

# REQUIRED_NAME
source: Name is required
es_mx: Nombre requerido
pt_br: Nome é obrigatório

# MIN_LENGTH_NAME
source: Name must be at least 3 characters long.
es_mx: El nombre debe tener al menos 3 caracteres.
pt_br: Nome deve ter no mínimo 3 caracteres.

# REQUIRED_DOCUMENT
source: Document is required
es_mx: Documento requerido
pt_br: Documento é obrigatório

source: Invalid document
es_mx: Documento inválido
pt_br: Documento inválido

# REQUIRED_ID
source: ID is required
es_mx: ID requerido
pt_br: ID é obrigatório

source: Invalid ID
es_mx: ID inválido
pt_br: ID inválido
